DataProcessors/БанковскиеВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>БанковскиеВыписки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Пусто - загружать по всем настроенным подразделениям.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНовые</Name>
					<Comment>Скрывать операции, по которым платежный документ уже есть.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исходящие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыКИмпорту</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Позначено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДок</Name>
							<Comment>Идентификатор операции банка = НомерВходящегоДокумента платежного документа.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроведения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКомпенсации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКомпенсацииОтличается</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетОтличается</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияМерчанта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияОтличается</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоступило</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСписано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗаказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Терминал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежныйДокумент</Name>
							<Comment>Заполнен - платеж уже заведен в базу.</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AuthCode</Name>
							<Comment>Код авторизации эквайринга WayForPay: ключ дедупликации платежа.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Входящий</Name>
							<Comment>Служебная колонка: по ней работает отбор строк на форме.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьДокумент</Name>
							<Comment>Служебная колонка: по ней работает отбор "Только новые".</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Comment>Включает подразделение в загрузку выписки.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиБанковскихВыписок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Токен</Name>
							<Comment>token Приват24 Бизнес либо X-Token Monobank.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Айди</Name>
							<Comment>id клиента (Приват24) либо id счета/карты (Monobank).</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Comment>Пусто - все операции.</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.НаправлениеБанковскихОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Comment>Попадает в СчетОрганизации создаваемых платежей.</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменена</Name>
							<Comment>Служебная: строка правилась в форме и требует записи.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/БанковскиеВыписки/Forms/ФормаОбмена/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма загрузки банковских выписок.
//
// Таблица операций живет в ХранилищеОбщихНастроек("ОбменПриват24",
// "ДокументыКИмпорту") — туда же пишет регламентное задание, поэтому форма
// показывает и то, что загрузилось в фоне.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Объект.НачалоПериода = НачалоДня(ТекущаяДата() - 7 * 24 * 60 * 60);
	Объект.КонецПериода  = КонецДня(ТекущаяДата());

	Объект.Входящие   = Истина;
	Объект.Исходящие  = Истина;
	Объект.ТолькоНовые = Ложь;

	// «Только мои заказы» — персональная настройка: у каждого пользователя своя.
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ТолькоМоиЗаказы     = (ХранилищеОбщихНастроек.Загрузить(
		"ОбменПриват24", "ТолькоМоиЗаказы") = Истина);

	ЗаполнитьТаблицуИзХранилища();
	НастроитьУсловноеОформление();

	ДатаОбновленияВыписки = БанковскиеВыписки.ДатаПоследнегоОбновленияВыписки();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьОтборСтрок();
	ОбновитьСводку();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьВыписку(Команда)

	Если Не ЗначениеЗаполнено(Объект.НачалоПериода)
		Или Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда

		Предупреждение("Укажите период загрузки.");
		Возврат;

	КонецЕсли;

	Если НачалоДня(Объект.НачалоПериода) > КонецДня(Объект.КонецПериода) Тогда
		Предупреждение("Начало периода больше его окончания.");
		Возврат;
	КонецЕсли;

	ПолучитьВыпискуНаСервере();

	УстановитьОтборСтрок();
	ОбновитьСводку();

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВ1С(Команда)

	Отмечено = 0;

	Для Каждого СтрокаТаблицы Из Объект.ДокументыКИмпорту Цикл

		Если ЭтоЧужаяСтрока(СтрокаТаблицы) Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаТаблицы.Загружать И Не СтрокаТаблицы.ЕстьДокумент Тогда
			Отмечено = Отмечено + 1;
		КонецЕсли;

	КонецЦикла;

	Если Отмечено = 0 Тогда
		Предупреждение("Не отмечено ни одной новой операции.");
		Возврат;
	КонецЕсли;

	Ответ = Вопрос(
		"Создать платежные документы по отмеченным операциям ("
		+ Строка(Отмечено) + ")?",
		РежимДиалогаВопрос.ДаНет);

	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	Предупреждение(ЗагрузитьВ1СНаСервере());

	УстановитьОтборСтрок();
	ОбновитьСводку();

КонецПроцедуры

// Выделяет строки с расхождением дат — чтобы сразу после этого нажать
// «Изменить дату платежа»: она работает по выделенным строкам.
&НаКлиенте
Процедура ВыделитьРасхождения(Команда)

	ВыделенныеСтроки = Элементы.ДокументыКИмпорту.ВыделенныеСтроки;
	ВыделенныеСтроки.Очистить();

	Для Каждого СтрокаТаблицы Из Объект.ДокументыКИмпорту Цикл

		Если Не СтрокаТаблицы.ДатаКомпенсацииОтличается Тогда
			Продолжить;
		КонецЕсли;

		// Скрытые отборами строки выделять нельзя: пользователь их не видит.
		Если ЭтоЧужаяСтрока(СтрокаТаблицы)
			Или (Объект.ТолькоНовые И СтрокаТаблицы.ЕстьДокумент)
			Или (Объект.Входящие И Не Объект.Исходящие И Не СтрокаТаблицы.Входящий)
			Или (Объект.Исходящие И Не Объект.Входящие И СтрокаТаблицы.Входящий) Тогда
			Продолжить;
		КонецЕсли;

		ВыделенныеСтроки.Добавить(СтрокаТаблицы.ПолучитьИдентификатор());

	КонецЦикла;

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Предупреждение("Строк с расхождением даты компенсации и даты платежа нет.");
		Возврат;
	КонецЕсли;

	Элементы.ДокументыКИмпорту.ТекущаяСтрока = ВыделенныеСтроки[0];

	Предупреждение(
		"Выделено строк с расхождением дат: "
		+ Строка(ВыделенныеСтроки.Количество())
		+ ". Нажмите «Изменить дату платежа», чтобы перенести даты.");

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуПлатежа(Команда)

	ВыделенныеСтроки = Элементы.ДокументыКИмпорту.ВыделенныеСтроки;

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Предупреждение("Выделите строки, у которых нужно изменить дату платежа.");
		Возврат;
	КонецЕсли;

	Идентификаторы = Новый Массив;

	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
		Идентификаторы.Добавить(Идентификатор);
	КонецЦикла;

	Предупреждение(ИзменитьДатуПлатежаНаСервере(Идентификаторы));

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)

	УстановитьОтметку(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)

	УстановитьОтметку(Ложь);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)

	УстановитьОтборСтрок();

КонецПроцедуры

&НаКлиенте
Процедура ТолькоМоиЗаказыПриИзменении(Элемент)

	СохранитьНастройкуТолькоМои();
	УстановитьОтборСтрок();
	ОбновитьСводку();

КонецПроцедуры

// Повторная загрузка при существующем платежном документе создаст дубль —
// галку на таких строках поставить нельзя.
&НаКлиенте
Процедура ДокументыКИмпортуЗагружатьПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДокументыКИмпорту.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.Загружать И ТекущиеДанные.ЕстьДокумент Тогда

		ТекущиеДанные.Загружать = Ложь;

		Предупреждение(
			"По этой операции уже есть платежный документ"
			+ ?(ЗначениеЗаполнено(ТекущиеДанные.ПлатежныйДокумент),
				": " + Строка(ТекущиеДанные.ПлатежныйДокумент), "")
			+ ". Повторная загрузка создала бы дубль.");

	КонецЕсли;

	ОбновитьСводку();

КонецПроцедуры

&НаКлиенте
Процедура ДокументыКИмпортуЗаказПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДокументыКИмпорту.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьСтрокуПоЗаказу(ТекущиеДанные.ПолучитьИдентификатор());

КонецПроцедуры

// Двойной клик по ячейке «Платежный документ» открывает документ.
&НаКлиенте
Процедура ДокументыКИмпортуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Неопределено
		Или Поле.Имя <> "ДокументыКИмпортуПлатежныйДокумент" Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.ДокументыКИмпорту.ТекущиеДанные;

	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.ПлатежныйДокумент) Тогда

		ОткрытьЗначение(ТекущиеДанные.ПлатежныйДокумент);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыКИмпортуКонтрагентПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДокументыКИмпорту.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Заказ прежнего контрагента больше не подходит.
	Если ЗначениеЗаполнено(ТекущиеДанные.Заказ) Тогда
		ТекущиеДанные.Заказ       = Неопределено;
		ТекущиеДанные.СуммаЗаказа = 0;
		ТекущиеДанные.Договор     = Неопределено;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборСтрок()

	Отбор = Новый Структура;

	Если Объект.ТолькоНовые Тогда
		Отбор.Вставить("ЕстьДокумент", Ложь);
	КонецЕсли;

	// Отбор по направлению имеет смысл, только если выбрано ровно одно
	// из двух: иначе показываем все операции.
	Если Объект.Входящие И Не Объект.Исходящие Тогда
		Отбор.Вставить("Входящий", Истина);
	ИначеЕсли Объект.Исходящие И Не Объект.Входящие Тогда
		Отбор.Вставить("Входящий", Ложь);
	КонецЕсли;

	Если ТолькоМоиЗаказы И ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Отбор.Вставить("Ответственный", ТекущийПользователь);
	КонецЕсли;

	Если ТолькоСРасхождениемДат Тогда
		Отбор.Вставить("ДатаКомпенсацииОтличается", Истина);
	КонецЕсли;

	Элементы.ДокументыКИмпорту.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);

КонецПроцедуры

// При включенном «Только мои заказы» строка считается чужой, если её
// ответственный — не текущий пользователь. Такие строки скрыты отбором,
// и ни отметки, ни загрузка их не трогают.
&НаКлиенте
Функция ЭтоЧужаяСтрока(СтрокаТаблицы)

	Возврат ТолькоМоиЗаказы
		И СтрокаТаблицы.Ответственный <> ТекущийПользователь;

КонецФункции

&НаСервере
Процедура СохранитьНастройкуТолькоМои()

	ХранилищеОбщихНастроек.Сохранить(
		"ОбменПриват24",
		"ТолькоМоиЗаказы",
		ТолькоМоиЗаказы);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметку(Значение)

	Для Каждого СтрокаТаблицы Из Объект.ДокументыКИмпорту Цикл

		// Чужие строки (отбор «Только мои заказы») не трогаем.
		Если ЭтоЧужаяСтрока(СтрокаТаблицы) Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаТаблицы.ЕстьДокумент Тогда
			// Платеж уже заведен — отмечать нечего.
			СтрокаТаблицы.Загружать = Ложь;
			Продолжить;
		КонецЕсли;

		СтрокаТаблицы.Загружать = Значение;

	КонецЦикла;

	ОбновитьСводку();

КонецПроцедуры

// Сводка под таблицей: сколько отмечено к загрузке, на какую сумму,
// когда выписка обновлялась последний раз.
&НаКлиенте
Процедура ОбновитьСводку()

	Отмечено = 0;
	Сумма    = 0;

	Для Каждого СтрокаТаблицы Из Объект.ДокументыКИмпорту Цикл

		Если ЭтоЧужаяСтрока(СтрокаТаблицы) Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаТаблицы.Загружать И Не СтрокаТаблицы.ЕстьДокумент Тогда
			Отмечено = Отмечено + 1;
			Сумма    = Сумма + СтрокаТаблицы.СуммаПоступило - СтрокаТаблицы.СуммаСписано;
		КонецЕсли;

	КонецЦикла;

	Сводка = "Отмечено строк: " + Строка(Отмечено)
		+ ",  сумма: " + Формат(Сумма, "ЧДЦ=2; ЧН=0")
		+ ?(ЗначениеЗаполнено(ДатаОбновленияВыписки),
			",  выписка обновлена: "
			+ Формат(ДатаОбновленияВыписки, "ДФ=dd.MM.yyyy HH:mm:ss"),
			",  выписка еще не обновлялась");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИзХранилища()

	УстановитьПривилегированныйРежим(Истина);
	Таблица = БанковскиеВыписки.ПолучитьТаблицуДокументовКИмпорту();
	УстановитьПривилегированныйРежим(Ложь);

	Объект.ДокументыКИмпорту.Загрузить(Таблица);

КонецПроцедуры

&НаСервере
Процедура СохранитьТаблицуВХранилище()

	УстановитьПривилегированныйРежим(Истина);
	БанковскиеВыписки.СохранитьТаблицуДокументовКИмпорту(
		Объект.ДокументыКИмпорту.Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Три цвета строк:
//   есть платежный документ            — белый (без оформления);
//   документа нет, отмечена к загрузке — ярко-фиолетовый;
//   документа нет, не отмечена         — бирюзовый.
&НаСервере
Процедура НастроитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ДобавитьОформлениеСтрок(Ложь, WebЦвета.Бирюзовый);
	ДобавитьОформлениеСтрок(Истина, WebЦвета.Фиолетовый);

	// Ячейка «Дата компенсации» — оранжевая, когда дата компенсации
	// не совпадает с датой платежа (по дню).
	Элемент = УсловноеОформление.Элементы.Добавить();

	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("ДокументыКИмпортуДатаКомпенсации");
	Поле.Использование = Истина;

	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(
		"Объект.ДокументыКИмпорту.ДатаКомпенсацииОтличается");
	Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Истина;
	Отбор.Использование  = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Оранжевый);

КонецПроцедуры

&НаСервере
Процедура ДобавитьОформлениеСтрок(ЗначениеЗагружать, ЦветФона)

	Элемент = УсловноеОформление.Элементы.Добавить();

	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("ДокументыКИмпорту");
	Поле.Использование = Истина;

	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ДокументыКИмпорту.ЕстьДокумент");
	Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;
	Отбор.Использование  = Истина;

	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ДокументыКИмпорту.Загружать");
	Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = ЗначениеЗагружать;
	Отбор.Использование  = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);

КонецПроцедуры

&НаСервере
Процедура ПолучитьВыпискуНаСервере()

	ПараметрыЗагрузки = Новый Структура;

	ПараметрыЗагрузки.Вставить("ДатаНачала",    НачалоДня(Объект.НачалоПериода));
	ПараметрыЗагрузки.Вставить("ДатаКонца",     КонецДня(Объект.КонецПериода));
	ПараметрыЗагрузки.Вставить("Подразделение", Объект.Подразделение);

	БанковскиеВыписки.ЗагрузитьБанковскиеВыписки(ПараметрыЗагрузки);

	ЗаполнитьТаблицуИзХранилища();

	ДатаОбновленияВыписки = БанковскиеВыписки.ДатаПоследнегоОбновленияВыписки();

КонецПроцедуры

// Дата платежа = дате компенсации: для строк с созданным документом
// меняется дата самого документа (с перепроведением), для остальных —
// дата в таблице, и созданный позже платеж получит уже её.
&НаСервере
Функция ИзменитьДатуПлатежаНаСервере(Идентификаторы)

	Изменено  = 0;
	Пропущено = 0;
	Ошибок    = 0;

	Для Каждого Идентификатор Из Идентификаторы Цикл

		СтрокаТаблицы = Объект.ДокументыКИмпорту.НайтиПоИдентификатору(Идентификатор);

		Если СтрокаТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаКомпенсации)
			Или Не СтрокаТаблицы.ДатаКомпенсацииОтличается Тогда

			Пропущено = Пропущено + 1;
			Продолжить;

		КонецЕсли;

		// Дата компенсации без времени — время оставляем от исходного платежа.
		НоваяДата = НачалоДня(СтрокаТаблицы.ДатаКомпенсации)
			+ (СтрокаТаблицы.ДатаПроведения - НачалоДня(СтрокаТаблицы.ДатаПроведения));

		Если СтрокаТаблицы.ЕстьДокумент
			И ЗначениеЗаполнено(СтрокаТаблицы.ПлатежныйДокумент) Тогда

			Попытка

				ДокументОбъект = СтрокаТаблицы.ПлатежныйДокумент.ПолучитьОбъект();
				ДокументОбъект.Дата = НоваяДата;

				Попытка
					ДокументОбъект.ДатаОплаты = НоваяДата;
				Исключение
					// У исходящего поручения реквизита может не быть.
				КонецПопытки;

				Если ДокументОбъект.Проведен Тогда
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					ДокументОбъект.Записать();
				КонецЕсли;

			Исключение

				СтрокаТаблицы.Ошибка = "Не удалось изменить дату документа: "
					+ ОписаниеОшибки();
				Ошибок = Ошибок + 1;
				Продолжить;

			КонецПопытки;

		КонецЕсли;

		СтрокаТаблицы.ДатаПроведения           = НоваяДата;
		СтрокаТаблицы.ДатаКомпенсацииОтличается = Ложь;
		СтрокаТаблицы.Ошибка                   = "";

		Изменено = Изменено + 1;

	КонецЦикла;

	СохранитьТаблицуВХранилище();

	Сообщение = "Дата изменена у строк: " + Строка(Изменено) + ".";

	Если Пропущено > 0 Тогда
		Сообщение = Сообщение
			+ Символы.ПС
			+ "Пропущено (дата компенсации пуста или совпадает): "
			+ Строка(Пропущено) + ".";
	КонецЕсли;

	Если Ошибок > 0 Тогда
		Сообщение = Сообщение
			+ Символы.ПС
			+ "С ошибкой: " + Строка(Ошибок)
			+ " (текст — в колонке «Ошибка»).";
	КонецЕсли;

	Возврат Сообщение;

КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуПоЗаказу(ИдентификаторСтроки)

	СтрокаТаблицы = Объект.ДокументыКИмпорту.НайтиПоИдентификатору(ИдентификаторСтроки);

	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Тогда
		СтрокаТаблицы.СуммаЗаказа   = 0;
		СтрокаТаблицы.Загружать     = Ложь;
		СтрокаТаблицы.Ответственный = Неопределено;
		Возврат;
	КонецЕсли;

	СтрокаТаблицы.Контрагент    = СтрокаТаблицы.Заказ.Контрагент;
	СтрокаТаблицы.Договор       = СтрокаТаблицы.Заказ.ДоговорКонтрагента;
	СтрокаТаблицы.СуммаЗаказа   = СтрокаТаблицы.Заказ.СуммаДокумента;
	СтрокаТаблицы.Ответственный = СтрокаТаблицы.Заказ.Ответственный;

	// Заказ подобран — операцию сразу отмечаем к загрузке.
	Если Не СтрокаТаблицы.ЕстьДокумент Тогда
		СтрокаТаблицы.Загружать = Истина;
	КонецЕсли;

КонецПроцедуры

// Создает платежные документы по отмеченным строкам.
// Поступление — платежное поручение входящее по заказу,
// списание — платежное поручение исходящее по счету организации.
&НаСервере
Функция ЗагрузитьВ1СНаСервере()

	Создано  = 0;
	Ошибок   = 0;
	Пропущено = 0;

	Для Каждого СтрокаТаблицы Из Объект.ДокументыКИмпорту Цикл

		Если Не СтрокаТаблицы.Загружать Или СтрокаТаблицы.ЕстьДокумент Тогда
			Продолжить;
		КонецЕсли;

		// При включенном «Только мои заказы» грузим только свои строки:
		// чужие скрыты отбором, пользователь их отметки не видит.
		Если ТолькоМоиЗаказы
			И СтрокаТаблицы.Ответственный <> ТекущийПользователь Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТаблицы.Ошибка = "";

		Если СтрокаТаблицы.СуммаПоступило <> 0 Тогда

			Результат = СоздатьПоступление(СтрокаТаблицы);

		ИначеЕсли СтрокаТаблицы.СуммаСписано <> 0 Тогда

			Результат = СоздатьСписание(СтрокаТаблицы);

		Иначе

			Пропущено = Пропущено + 1;
			СтрокаТаблицы.Ошибка = "Нулевая сумма операции.";
			Продолжить;

		КонецЕсли;

		Если Результат.Успешно Тогда

			СтрокаТаблицы.ПлатежныйДокумент = Результат.Ссылка;
			СтрокаТаблицы.ЕстьДокумент      = Истина;
			СтрокаТаблицы.Загружать         = Ложь;

			// Менеджеру заказа — задача о том, что оплата проведена.
			Если СтрокаТаблицы.СуммаПоступило <> 0
				И ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Тогда

				БанковскиеВыписки.СоздатьЗадачуПоСозданномуПлатежу(
					СтрокаТаблицы.Заказ,
					Результат.Ссылка);

			КонецЕсли;

			Создано = Создано + 1;

		Иначе

			СтрокаТаблицы.Ошибка = Результат.Сообщение;
			Ошибок = Ошибок + 1;

		КонецЕсли;

	КонецЦикла;

	СохранитьТаблицуВХранилище();

	Сообщение = "Создано документов: " + Строка(Создано) + ".";

	Если Ошибок > 0 Тогда
		Сообщение = Сообщение
			+ Символы.ПС
			+ "С ошибкой: " + Строка(Ошибок)
			+ " (текст ошибки — в колонке «Ошибка»).";
	КонецЕсли;

	Если Пропущено > 0 Тогда
		Сообщение = Сообщение
			+ Символы.ПС
			+ "Пропущено операций с нулевой суммой: " + Строка(Пропущено) + ".";
	КонецЕсли;

	Возврат Сообщение;

КонецФункции

&НаСервере
Функция СоздатьПоступление(СтрокаТаблицы)

	Платеж = Документы.ПлатежноеПоручениеВходящее.ОписаниеПлатежаПоЗаказу();

	Платеж.Сумма                   = СтрокаТаблицы.СуммаПоступило;
	Платеж.ДатаПлатежа             = СтрокаТаблицы.ДатаПроведения;
	Платеж.НомерВходящегоДокумента = СтрокаТаблицы.НомерДок;
	Платеж.AuthCode                = СтрокаТаблицы.AuthCode;
	Платеж.СчетОрганизации         = СтрокаТаблицы.СчетОрганизации;
	Платеж.Подразделение           = СтрокаТаблицы.Подразделение;
	Платеж.Контрагент              = СтрокаТаблицы.Контрагент;
	Платеж.ДоговорКонтрагента      = СтрокаТаблицы.Договор;
	Платеж.НазначениеПлатежа       = СтрокаТаблицы.Содержание;
	Платеж.Комментарий             = ТекстКомментария(СтрокаТаблицы);

	Возврат Документы.ПлатежноеПоручениеВходящее.СоздатьПлатежПоЗаказу(
		СтрокаТаблицы.Заказ,
		Платеж);

КонецФункции

&НаСервере
Функция СоздатьСписание(СтрокаТаблицы)

	Списание = Документы.ПлатежноеПоручениеИсходящее.ОписаниеСписанияПоВыписке();

	Списание.Сумма                   = СтрокаТаблицы.СуммаСписано;
	Списание.ДатаПлатежа             = СтрокаТаблицы.ДатаПроведения;
	Списание.НомерВходящегоДокумента = СтрокаТаблицы.НомерДок;
	Списание.СчетОрганизации         = СтрокаТаблицы.СчетОрганизации;
	Списание.Подразделение           = СтрокаТаблицы.Подразделение;
	Списание.Контрагент              = СтрокаТаблицы.Контрагент;
	Списание.ДоговорКонтрагента      = СтрокаТаблицы.Договор;
	Списание.НазначениеПлатежа       = СтрокаТаблицы.Содержание;
	Списание.Комментарий             = ТекстКомментария(СтрокаТаблицы);

	Возврат Документы.ПлатежноеПоручениеИсходящее.СоздатьСписаниеПоВыписке(Списание);

КонецФункции

&НаСервере
Функция ТекстКомментария(СтрокаТаблицы)

	Текст = "Выписка " + СокрЛП(СтрокаТаблицы.НомерДок);

	Если Не ПустаяСтрока(СокрЛП(СтрокаТаблицы.Терминал)) Тогда
		Текст = Текст + "; " + СокрЛП(СтрокаТаблицы.Терминал);
	КонецЕсли;

	Возврат Текст;

КонецФункции

#КонецОбласти
